# DimStyleCenterlineTickMark Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimStyleCenterlineTickMark Property
ParameterTypeId Class See Also
---
"Centerline Tick Mark"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimStyleCenterlineTickMark { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimStyleCenterlineTickMark As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimStyleCenterlineTickMark {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace